Revit 2027 API
PipeFittingAndAccessoryConnectorData.LinkIndex Property
 The index of the connector which is linked with this connector
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int LinkIndex { get; }
Public ReadOnly Property LinkIndex As Integer
	Get
public:
property int LinkIndex {
	int get ();
}
member LinkIndex : int with get
Property Value
Int32
See Also
Reference
PipeFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Plumbing Namespace